Последний месяц я программировал на баше и хочу поделиться своими впечатлениями.
Года два назад мне приходилось писать нетривиальный скрипт с использованием баша и это было отвратительно.

В этот раз у меня был достаточно интересный проект, связанный с гитом. В итоге получился скрипт строк на 100-150
и еще столько же (по объему) тестов к нему.

Общее впечатление такое: на баше тоже можно писать код, в меру эффективный и понятный, но все-таки лучше этого не делать. 

Ниже я хочу обсудить следующие вопросы: почему люди до сих пор используют баш, недостатки этого подхода, и что же делать,
если вы все-таки пишите на баше.

Меня всегда удивляло две вещи: сколько всякой фигни написано на баше и гордость людей за то, что они умеют производить
на свет `баш-скрипты-недопрограммы`. Теперь я не удивляюсь, потому что начинаю понимать природу этих вещей.
А причина всего очень простая: на баше можно писать сложные, непонятные, короткие и полезные программы.
Взрывная смесь этих четырех качеств приводит к удивительным последствиям.


